Обработки/Reports/_ЗадолженностиИОстатокДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЗадолженностиИОстатокДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыЗадолженности</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСравненияОстаткаНаРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокМеньшеЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЗадолженностиИОстатокДС/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Задолженности и остаток денежных средств",
		"0.13",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьТекстЗапроса() Экспорт
	
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание
		|ПОМЕСТИТЬ ВТ_ЗадолженностиПоДенежнымСредствам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ГраницаОкончания,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И (НЕ &ОтборПоВидуЗадолженности
		|					ИЛИ ВидЗадолженности В (&ВидыЗадолженности))
		|				И (НЕ &ОтборПоВидуДоговораДоверительногоУправления
		|					ИЛИ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОстатки.Брокер
		|		ИНАЧЕ ОстаткиДенежныхСредствОстатки.РасчетныйСчет.Банк
		|	КОНЕЦ КАК Банк,
		|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет КАК Расчетныйсчет,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток - ЕСТЬNULL(ДенежныеСредстваМНООстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта
		|ПОМЕСТИТЬ ВТ_ОстаткиДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&ГраницаОкончания,
		|			Организация = &Организация
		|				И (НЕ &ОтборПоВидуДоговораДоверительногоУправления
		|					ИЛИ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления))
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|					ИЗ
		|						ВТ_ЗадолженностиПоДенежнымСредствам КАК ВТ_ЗадолженностиПоДенежнымСредствам)) КАК ОстаткиДенежныхСредствОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваМНО.Остатки(
		|				&ГраницаОкончания,
		|				Организация = &Организация
		|					И (НЕ &ОтборПоВидуДоговораДоверительногоУправления
		|						ИЛИ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДоверительногоУправления))
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|						ИЗ
		|							ВТ_ЗадолженностиПоДенежнымСредствам КАК ВТ_ЗадолженностиПоДенежнымСредствам)) КАК ДенежныеСредстваМНООстатки
		|		ПО ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления = ДенежныеСредстваМНООстатки.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредствОстатки.РасчетныйСчет = ДенежныеСредстваМНООстатки.РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	ВТ_ЗадолженностиПоДенежнымСредствам КАК ВТ_ЗадолженностиПоДенежнымСредствам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ОстаткиДенежныхСредств.Банк КАК Банк,
		|	ТИПЗНАЧЕНИЯ(ВТ_ОстаткиДенежныхСредств.Банк) КАК ТипЗначения
		|ИЗ
		|	ВТ_ОстаткиДенежныхСредств КАК ВТ_ОстаткиДенежныхСредств
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипЗначения,
		|	Банк
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления, ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.Валюта, ВТ_ОстаткиДенежныхСредств.Валюта) КАК Валюта,
		|	ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.СуммаОстаток, 0) КАК СуммаЗадолженности,
		|	ЕСТЬNULL(ВТ_ОстаткиДенежныхСредств.СуммаОстаток, 0) КАК СуммаОстатка,
		|	ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.Валюта.Код, ВТ_ОстаткиДенежныхСредств.Валюта.Код) КАК КодВалюты,
		|	ЕСТЬNULL(ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах.СуммаОстаток, 0) КАК СуммаОстаткаНаРасчетныхСчетах,
		|	КодыСчетовУБрокера.Код КАК КодСчетаБрокера
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВТ_ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|		СУММА(ВТ_ЗадолженностиПоДенежнымСредствам.СуммаОстаток) КАК СуммаОстаток
		|	ИЗ
		|		ВТ_ЗадолженностиПоДенежнымСредствам КАК ВТ_ЗадолженностиПоДенежнымСредствам
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления,
		|		ВТ_ЗадолженностиПоДенежнымСредствам.Валюта) КАК ВТ_ЗадолженностиПоДенежнымСредствам
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			ВТ_ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|			СУММА(ВТ_ОстаткиДенежныхСредств.СуммаОстаток) КАК СуммаОстаток
		|		ИЗ
		|			ВТ_ОстаткиДенежныхСредств КАК ВТ_ОстаткиДенежныхСредств
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|			ВТ_ОстаткиДенежныхСредств.Валюта) КАК ВТ_ОстаткиДенежныхСредств
		|		ПО ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления
		|			И ВТ_ЗадолженностиПоДенежнымСредствам.Валюта = ВТ_ОстаткиДенежныхСредств.Валюта
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			ВТ_ОстаткиДенежныхСредств.Валюта КАК Валюта,
		|			СУММА(ВТ_ОстаткиДенежныхСредств.СуммаОстаток) КАК СуммаОстаток
		|		ИЗ
		|			ВТ_ОстаткиДенежныхСредств КАК ВТ_ОстаткиДенежныхСредств
		|		ГДЕ
		|			ВТ_ОстаткиДенежныхСредств.Банк ССЫЛКА Справочник.Банки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|			ВТ_ОстаткиДенежныхСредств.Валюта) КАК ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах
		|		ПО (ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления = ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах.СчетДоверительногоУправления)
		|			И (ВТ_ОстаткиДенежныхСредств.Валюта = ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах.Валюта)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код) КАК Код
		|		ИЗ
		|			РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&ГраницаОкончания, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
		|				ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = ИменованныеОбъекты.Объект
		|					И (ИменованныеОбъекты.Имя = ""Брокер_БК_Регион"")
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
		|		
		|		ИМЕЮЩИЕ
		|			СУММА(1) = 1) КАК КодыСчетовУБрокера
		|		ПО (ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления, ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления) = КодыСчетовУБрокера.СчетДоверительногоУправления)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборСравненияОстаткаНаРС
		|					И &ОстатокМеньшеЗадолженности
		|				ТОГДА ЕСТЬNULL(ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах.СуммаОстаток, 0) < ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.СуммаОстаток, 0)
		|			КОГДА &ОтборСравненияОстаткаНаРС
		|					И НЕ &ОстатокМеньшеЗадолженности
		|				ТОГДА ЕСТЬNULL(ВТ_ОстаткиДенежныхСредств_НаРасчетныхСчетах.СуммаОстаток, 0) >= ЕСТЬNULL(ВТ_ЗадолженностиПоДенежнымСредствам.СуммаОстаток, 0)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления,
		|	КодВалюты
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|	ВТ_ЗадолженностиПоДенежнымСредствам.СуммаОстаток КАК СуммаЗадолженности,
		|	ВТ_ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
		|	ВТ_ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	ВТ_ЗадолженностиПоДенежнымСредствам КАК ВТ_ЗадолженностиПоДенежнымСредствам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_ОстаткиДенежныхСредств.Банк КАК Банк,
		|	ВТ_ОстаткиДенежныхСредств.Расчетныйсчет КАК Расчетныйсчет,
		|	ВТ_ОстаткиДенежныхСредств.Расчетныйсчет.НомерСчета КАК НомерСчета,
		|	ВТ_ОстаткиДенежныхСредств.СуммаОстаток КАК СуммаОстатка,
		|	ВТ_ОстаткиДенежныхСредств.Валюта КАК Валюта
		|ИЗ
		|	ВТ_ОстаткиДенежныхСредств КАК ВТ_ОстаткиДенежныхСредств";
	
	
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация,ОтборПоВидуЗадолженности,ВидыЗадолженности,ОтборПоВидуДоговораДоверительногоУправления,
																																	      |ВидыДоговоровДоверительногоУправления,ОтборСравненияОстаткаНаРС,ОстатокМеньшеЗадолженности");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("Организация"									, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ГраницаОкончания"							, Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОтборПоВидуЗадолженности"					, ЭтотОбъект.ОтборПоВидуЗадолженности);
	Запрос.УстановитьПараметр("ВидыЗадолженности"							, ЭтотОбъект.ВидыЗадолженности);
	Запрос.УстановитьПараметр("ОтборПоВидуДоговораДоверительногоУправления"	, ЭтотОбъект.ОтборПоВидуДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидыДоговоровДоверительногоУправления"		, ЭтотОбъект.ВидыДоговоровДоверительногоУправления);
	Запрос.УстановитьПараметр("ОтборСравненияОстаткаНаРС"					, ЭтотОбъект.ОтборСравненияОстаткаНаРС);
	Запрос.УстановитьПараметр("ОстатокМеньшеЗадолженности"					, ЭтотОбъект.ОстатокМеньшеЗадолженности);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Если ЭтотОбъект.ПечатнаяФорма = "ОбщаяПечатнаяФорма" Тогда
		ЗаполнитьОбщуюПечатнуюФорму(ДокументРезультат, Пакет);	
	ИначеЕсли ЭтотОбъект.ПечатнаяФорма = "ЗаявкаНаВыводДенежныхСредств" Тогда
		ЗаполнитьЗаявкаНаВыводДенежныхСредств(ДокументРезультат, Пакет);
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ЗаполнитьОбщуюПечатнуюФорму(ДокументРезультат, Пакет)
	
	Если ЭтотОбъект.ОтборПоВидуЗадолженности Тогда
		МассивВидовЗадолженностей = ЭтотОбъект.ВидыЗадолженности.ВыгрузитьЗначения();
	Иначе
		МассивВидовЗадолженностей	= Пакет[2].Выгрузить().ВыгрузитьКолонку("ВидЗадолженности");
	КонецЕсли;
		
	МассивБанков			= Пакет[3].Выгрузить().ВыгрузитьКолонку("Банк");
	
	ТаблицаИтогов			= Пакет[4].Выгрузить();
	ТаблицаЗадолженности	= Пакет[5].Выгрузить();
	ТаблицаОстатковДС		= Пакет[6].Выгрузить();
	
	Макет = ПолучитьМакет(ЭтотОбъект.ПечатнаяФорма);
	
	ОбластьЗаголовокОтчёта = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовокОтчёта.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	ДокументРезультат.Вывести(ОбластьЗаголовокОтчёта);
	
	//Отборы
	
	ВывестиСекциюОтборы(ДокументРезультат, Макет);
	
	//Шапка
	ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Шапка|Основная"));
	Для Каждого ВидЗадолженности Из МассивВидовЗадолженностей Цикл
		ОбластьШапкаВидЗадолженности = Макет.ПолучитьОбласть("Шапка|ВидЗадолженности");
		ОбластьШапкаВидЗадолженности.Параметры.ВидЗадолженности = ВидЗадолженности;
		ДокументРезультат.Присоединить(ОбластьШапкаВидЗадолженности);
	КонецЦикла;
	
	ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|ВидЗадолженностиИтого"));
	ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 2, 4, ДокументРезультат.ВысотаТаблицы - 2, МассивВидовЗадолженностей.Количество() + 4).Объединить();
	
	Для Каждого Банк Из МассивБанков Цикл
		ОбластьШапкаОстаткиДС = Макет.ПолучитьОбласть("Шапка|ОстаткиДС");
		ОбластьШапкаОстаткиДС.Параметры.Банк = ?(ТипЗнч(Банк) = Тип("СправочникСсылка.Банки"), "р/счет в ", "брокерский счет в ") + Банк;
		ДокументРезультат.Присоединить(ОбластьШапкаОстаткиДС);
	КонецЦикла;
	
	ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 2, МассивВидовЗадолженностей.Количество() + 5, ДокументРезультат.ВысотаТаблицы - 2, МассивВидовЗадолженностей.Количество() + 4 + МассивБанков.Количество() * 2).Объединить();
	ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|ОстаткиДСИтого"));
	
	//Конец Шапки
	
	СчетДоверительногоУправления	= Неопределено;
	НомерНачалаОбластиСчетДУ		= 0;
	
	Для Каждого СтрокаИтогов Из ТаблицаИтогов Цикл
		Если СчетДоверительногоУправления <> СтрокаИтогов.СчетДоверительногоУправления Тогда
			НомерНачалаОбластиСчетДУ = ДокументРезультат.ВысотаТаблицы + 1;
			СчетДоверительногоУправления = СтрокаИтогов.СчетДоверительногоУправления;
		КонецЕсли;
		
		КоличествоСчетов = 1;
		
		Для НомерСчета = 1 По КоличествоСчетов Цикл
		
			ОбластьСтрокаОсновная = Макет.ПолучитьОбласть("Строка|Основная");
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаОсновная.Параметры, СтрокаИтогов);
			ДокументРезультат.Вывести(ОбластьСтрокаОсновная);
			
			Для Каждого ВидЗадолженности Из МассивВидовЗадолженностей Цикл
				ПараметрыПоиска = Новый Структура("СчетДоверительногоУправления,Валюта,ВидЗадолженности", СтрокаИтогов.СчетДоверительногоУправления, СтрокаИтогов.Валюта, ВидЗадолженности);
				НайденныеСтроки = ТаблицаЗадолженности.НайтиСтроки(ПараметрыПоиска);
				
				Основания = Новый Массив;
				СуммаЗадолженности = 0;
				
				Для Каждого СтрокаЗадолженности Из НайденныеСтроки Цикл
					Основания.Добавить(СтрокаЗадолженности.Основание);
					СуммаЗадолженности = СуммаЗадолженности + СтрокаЗадолженности.СуммаЗадолженности;
				КонецЦикла;	
				
				ОбластьСтрокаВидЗадолженности = Макет.ПолучитьОбласть("Строка|ВидЗадолженности");
				ОбластьСтрокаВидЗадолженности.Параметры.Основания			= Основания;
				ОбластьСтрокаВидЗадолженности.Параметры.СуммаЗадолженности	= СуммаЗадолженности;
				ДокументРезультат.Присоединить(ОбластьСтрокаВидЗадолженности);
			КонецЦикла;
			
			ОбластьСтрокаВидЗадолженностиИтого = Макет.ПолучитьОбласть("Строка|ВидЗадолженностиИтого");
			ОбластьСтрокаВидЗадолженностиИтого.Параметры.СуммаЗадолженности = СтрокаИтогов.СуммаЗадолженности;
			ДокументРезультат.Присоединить(ОбластьСтрокаВидЗадолженностиИтого);
		

			Для Каждого Банк Из МассивБанков Цикл
				ПараметрыПоиска = Новый Структура("СчетДоверительногоУправления,Валюта,Банк", СтрокаИтогов.СчетДоверительногоУправления, СтрокаИтогов.Валюта, Банк);
				НайденныеСтроки = ТаблицаОстатковДС.НайтиСтроки(ПараметрыПоиска);
				
				ОбластьСтрокаОстаткиДС = Макет.ПолучитьОбласть("Строка|ОстаткиДС");
				
				Если НомерСчета <= НайденныеСтроки.Количество() Тогда
					ЗаполнитьЗначенияСвойств(ОбластьСтрокаОстаткиДС.Параметры, НайденныеСтроки[НомерСчета - 1]);
				КонецЕсли;
				
				КоличествоСчетов = МАКС(КоличествоСчетов, НайденныеСтроки.Количество());
				
				ДокументРезультат.Присоединить(ОбластьСтрокаОстаткиДС);
			КонецЦикла;
		
			ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Строка|ОстаткиДСИтого"));
		
		КонецЦикла;
		
		//объединить счета ДУ
		ДокументРезультат.Область(НомерНачалаОбластиСчетДУ, 1, ДокументРезультат.ВысотаТаблицы, 1).Объединить();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗаявкаНаВыводДенежныхСредств(ДокументРезультат, Пакет)
	
	Если ЭтотОбъект.ОтборПоВидуЗадолженности Тогда
		МассивВидовЗадолженностей = ЭтотОбъект.ВидыЗадолженности.ВыгрузитьЗначения();
	Иначе
		МассивВидовЗадолженностей	= Пакет[2].Выгрузить().ВыгрузитьКолонку("ВидЗадолженности");
	КонецЕсли;
		
	ТаблицаИтогов			= Пакет[4].Выгрузить();
	
	Макет = ПолучитьМакет(ЭтотОбъект.ПечатнаяФорма);
	
	ОбластьЗаголовокОтчёта = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовокОтчёта.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	ДокументРезультат.Вывести(ОбластьЗаголовокОтчёта);
	
	//Отборы
	
	ВывестиСекциюОтборы(ДокументРезультат, Макет);
	
	//Шапка
	ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	//Конец Шапки
	
	СчетДоверительногоУправления	= Неопределено;
	НомерНачалаОбластиСчетДУ		= 0;
	
	Для Каждого СтрокаИтогов Из ТаблицаИтогов Цикл
		Если СчетДоверительногоУправления <> СтрокаИтогов.СчетДоверительногоУправления Тогда
			НомерНачалаОбластиСчетДУ = ДокументРезультат.ВысотаТаблицы + 1;
			СчетДоверительногоУправления = СтрокаИтогов.СчетДоверительногоУправления;
		КонецЕсли;
		
		КоличествоСчетов = 1;
		
		Для НомерСчета = 1 По КоличествоСчетов Цикл
		
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаИтогов);
			ДокументРезультат.Вывести(ОбластьСтрока);
		
		КонецЦикла;
		
		//объединить счета ДУ
		ДокументРезультат.Область(НомерНачалаОбластиСчетДУ, 1, ДокументРезультат.ВысотаТаблицы, 1).Объединить();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСекциюОтборы(ДокументРезультат, Макет)
	
	ОбластьОтбор = Макет.ПолучитьОбласть("Отбор");
	
	Если ЭтотОбъект.ОтборПоВидуДоговораДоверительногоУправления Тогда
		ОбластьОтбор.Параметры.ОписаниеОтбора = "Отбор по виду договора ДУ: ";
		Для Каждого ЭлементСписка Из ЭтотОбъект.ВидыДоговоровДоверительногоУправления Цикл
			ОбластьОтбор.Параметры.ОписаниеОтбора = ОбластьОтбор.Параметры.ОписаниеОтбора + Строка(ЭлементСписка.Значение) + ";";
		КонецЦикла;
		ДокументРезультат.Вывести(ОбластьОтбор);
	КонецЕсли;	
	
	Если ЭтотОбъект.ОтборПоВидуЗадолженности Тогда
		ОбластьОтбор.Параметры.ОписаниеОтбора = "Отбор по виду задолженности: ";
		Для Каждого ЭлементСписка Из ЭтотОбъект.ВидыЗадолженности Цикл
			ОбластьОтбор.Параметры.ОписаниеОтбора = ОбластьОтбор.Параметры.ОписаниеОтбора + Строка(ЭлементСписка.Значение) + ";";
		КонецЦикла;
		ДокументРезультат.Вывести(ОбластьОтбор);
	КонецЕсли;
	
	Если ЭтотОбъект.ОтборСравненияОстаткаНаРС Тогда
		Если ЭтотОбъект.ОстатокМеньшеЗадолженности Тогда
			ОбластьОтбор.Параметры.ОписаниеОтбора = "Отбор сравнения остатка на р/счетах: остаток на р/счетах меньше задолженности";
		Иначе
			ОбластьОтбор.Параметры.ОписаниеОтбора = "Отбор сравнения остатка на р/счетах: остаток на р/счетах больше или равен задолженности";
		КонецЕсли;
		ДокументРезультат.Вывести(ОбластьОтбор);
	КонецЕсли;
	
	
	ДокументРезультат.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));

КонецПроцедуры
